uhnp/src/DataProcessors/НазначениеПоставщиковНоменклатуреЛота/НазначениеПоставщиковНоменклатуреЛота.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>НазначениеПоставщиковНоменклатуреЛота</name>
  <tabularSections>
    <name>РаспределениеПоПотребностям</name>
    <attributes>
      <name>Приоритет</name>
      <type>
        <types>CatalogRef.ПриоритетыПотребностей</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <comment>Номенклатура заказанная поставщику (нет товарных категорий)</comment>
      <type>
        <types>DefinedType.ТипНоменклатураЕХ</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодПотребности</name>
      <type>
        <types>CatalogRef.Периоды</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>МестоПоставки</name>
      <type>
        <types>CatalogRef.МестаПоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>Менеджер</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорСПокупателем</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредложениеПоставщика</name>
      <type>
        <types>DocumentRef.ПредложениеПоставщика</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>DefinedType.ТипЕдиницаИзмеренияЕХ</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>DefinedType.КоэффициентЕдиницыИзмеренияУХ</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Поставщик</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ТоварНеПоставляется</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПоЛоту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПоПобедителю</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПоПобедителю</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПредложения</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>МестоПобедителя</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтраныПроисхождения</name>
      <type>
        <types>CatalogRef.СтраныМира</types>
      </type>
    </attributes>
    <attributes>
      <name>Партнер</name>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>СтранаПроизводителя</name>
      <type>
        <types>CatalogRef.СтраныМира</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураПоставщика</name>
      <type>
        <types>CatalogRef.НоменклатураПоставщиков</types>
        <types>CatalogRef.НоменклатураКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦФО</name>
      <type>
        <types>DefinedType.ЦФО</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаПервоначальная</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Преференции</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОграничениеЗакупки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НациональныйРежим</name>
      <type>
        <types>EnumRef.НациональныйРежимЗакупок</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

uhnp/src/AccumulationRegisters/ПланированиеПотребностей/ПланированиеПотребностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПланированиеПотребностей</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <attributes>
    <name>ИсточникВерсии</name>
    <type>
      <types>DefinedType.ИсточникВерсии</types>
    </type>
  </attributes>
  <attributes>
    <name>КорректировкаДокумента</name>
    <type>
      <types>DefinedType.КорректировкаДокумента</types>
    </type>
  </attributes>
  <dimensions>
    <name>АналитикаИсточника</name>
    <type>
      <types>CatalogRef.КлючиАналитикПланирования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаПланирования</name>
    <type>
      <types>CatalogRef.КлючиАналитикПланирования</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

uhnp/src/Enums/ВидЛотовойЗакупки/ВидЛотовойЗакупки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидЛотовойЗакупки</name>
  <enumValues>
    <name>ЛотоваяЗакупка</name>
  </enumValues>
  <enumValues>
    <name>ПопозиционнаяЗакупка</name>
  </enumValues>
  <enumValues>
    <name>Зонтичная</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ЭтапыПланированияПотребностей/ЭтапыПланированияПотребностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЭтапыПланированияПотребностей</name>
  <enumValues>
    <name>ЗаявкиНаЗакупку</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкиСогласованные</name>
  </enumValues>
  <enumValues>
    <name>БюджетЗакупокОрганизации</name>
  </enumValues>
  <enumValues>
    <name>ЗакупочныеПроцедуры</name>
  </enumValues>
  <enumValues>
    <name>ВыбранПоставщик</name>
  </enumValues>
  <enumValues>
    <name>Законтрактовано</name>
  </enumValues>
  <enumValues>
    <name>ЗаказыПоставщикам</name>
  </enumValues>
  <enumValues>
    <name>Исполнено</name>
    <comment>Движений по этому разделу нет и не будет</comment>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ВариантыИспользованияХарактеристикНоменклатуры/ВариантыИспользованияХарактеристикНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыИспользованияХарактеристикНоменклатуры</name>
  <enumValues>
    <name>НеИспользовать</name>
  </enumValues>
  <enumValues>
    <name>ОбщиеДляВидаНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ИндивидуальныеДляНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ОбщиеСДругимВидомНоменклатуры</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/DataProcessors/НазначениеПоставщиковНоменклатуреЛота/Forms/ФормаСозданияДоговоров/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтруктураРеквизитовШаблона = Справочники.Лоты.ПолучитьРеквизитыШаблонаЛотаВСтруктуре();
	ИменаКлючевыхПолей = ЦентрализованныеЗакупкиКлиентСерверУХ.ИменаКлючевыхПолейКроссТаблицыПотребностей();
	
	НастройкаЗонтичнойЗакупки();

	СтруктураЦветФона = Новый Структура("ЦветФона", WebЦвета.Роса);
	ЦентрализованныеЗакупкиВызовСервераУХ.ВыделитьЭлементыФормы(
	ЭтаФорма, СтруктураРеквизитовШаблона, СтруктураЦветФона);
 
	КонтенкстКроссТаблицы = ЦентрализованныеЗакупкиУХ.ПолучитьТиповойКонтекстКроссТаблицыПотребностей(
	"ПериодыЗакупок", "ПотребностиВНоменклатуреПоПериодам",	
	"ПотребностиВНоменклатуреПоПериодам", ИменаКлючевыхПолей);
	

	ЦентрализованныеЗакупкиУХ.ИнициализироватьКроссТаблицуПотребностей(
	ЭтаФорма, "ПараметрыКроссТаблицыПотребностей", КонтенкстКроссТаблицы);
	
КонецПроцедуры

&НаСервере
Процедура НастройкаЗонтичнойЗакупки()
	
	Если Объект.ВидЗакупки <> Перечисления.ВидЛотовойЗакупки.Зонтичная Тогда
		Возврат;
	КонецЕсли;	
	Элементы.МестоПоЗонтичнойЗакупке.Видимость = Истина;
	МестоПобедителя = 1;
	Пока МестоПобедителя <= Объект.КоличествоПобедителейЗонтичнойЗакупки Цикл
		Элементы.МестоПоЗонтичнойЗакупке.СписокВыбора.Вставить(МестоПобедителя-1,МестоПобедителя);//Добавить(МестоПобедителя);	
		МестоПобедителя = МестоПобедителя+1;
	КонецЦикла;
	МестоПоЗонтичнойЗакупке = 1;
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеКроссТаблицы(Контекст) Экспорт

КонецПроцедуры

&НаСервере
Процедура СкопироватьВКроссТаблицу(Контекст) Экспорт
	Если НЕ ЗначениеЗаполнено(Объект.ПериодЗакупок) Тогда
		Возврат;
	КонеЦЕсли;
	
	Номенклатура = "Номенклатура";
	ЗонтичнаяНоменклатура = "УсловияРаспределенияЗонтичнойЗакупки";
	ПотребностиВНоменклатуреПоПериодам.Очистить();    
	РезультатЗапроса = ПолучитьРезультатЗапросаТЧНоменклатурыПоПериодам(
	?(Объект.ВидЗакупки <> Перечисления.ВидЛотовойЗакупки.Зонтичная,Объект[Номенклатура],Объект[ЗонтичнаяНоменклатура]),
	ЭтаФорма[Контекст.ИмяТаблицыПериодов],
	Контекст.ИменаКлючевыхПолейКроссТаблицы);		
	
	ДозаполнитьТаблицуПотребностейИзРезультатаЗапроса(
	РезультатЗапроса); 
	
КонецПроцедуры   

&НаСервере
Процедура ДозаполнитьТаблицуПотребностейИзРезультатаЗапроса(РезультатЗапроса)
	ЦентрализованныеЗакупкиУХ.ДозаполнитьТаблицуПотребностейИзРезультатаЗапроса(
		ПотребностиВНоменклатуреПоПериодам,
		РезультатЗапроса,
		ЭтаФорма.ПараметрыКроссТаблицыПотребностей.ИменаКлючевыхПолейКроссТаблицы);
	ЦентрализованныеЗакупкиКлиентСерверУХ.ПересчитатьИтоговыеПоказателиКроссТаблицы(
		ПотребностиВНоменклатуреПоПериодам,
		ЭтаФорма.ПериодыЗакупок,
		Объект.ЦенаВключаетНДС);	
	ОбновитьСуммуДокументаИзКроссТаблицы(ЭтаФорма);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьСуммуДокументаИзКроссТаблицы(Форма)
	//Форма.ИтогоСуммаПоНоменклатуре =
	//	Форма.ПотребностиВНоменклатуреПоПериодам.Итог("Сумма");
	//Форма.Объект.СуммаЛота = Форма.ИтогоСуммаПоНоменклатуре;
	//Форма.Объект.СуммаНДС =
	//	Форма.ПотребностиВНоменклатуреПоПериодам.Итог("СуммаНДС");
	//РассчитатьВеличинуОбеспеченияЗаявки(Форма.Объект);
	//РассчитатьВеличинуОбеспеченияДоговора(Форма.Объект);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура РассчитатьВеличинуОбеспеченияДоговора(Объект)
	Объект.ВеличинаОбеспеченияДоговора = Объект.СуммаЛота * 
		Объект.ПроцентОтСуммыЗаявкиОбеспеченияДоговора / 100;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура РассчитатьВеличинуОбеспеченияЗаявки(Объект)
	Объект.ВеличинаОбеспеченияЗаявки = Объект.СуммаЛота *
		Объект.ПроцентОтСуммыЛотаОбеспеченияЗаявки / 100;
КонецПроцедуры

&НаСервере
Функция ПолучитьРезультатЗапросаТЧНоменклатурыПоПериодам(
	ТЧНоменклатура,
	ПериодыЗакупок,
	ИменаКлючевыхПолейКроссТаблицы)
	Запрос = Новый Запрос;   
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	Запрос.УстановитьПараметр("ОбъектПланирования",ОбъектыПланирования.ПолучитьОбъектПланирования(Объект.Ссылка));
	Запрос.УстановитьПараметр("ЭтапПланирования",ПредопределенноеЗначение("Перечисление.ЭтапыПланированияПотребностей.ЗакупочныеПроцедуры"));
	Запрос.Текст = "ВЫБРАТЬ
	|	ПланированиеПотребностейОстатки.АналитикаИсточника КАК АналитикаИсточника,
	|	ПланированиеПотребностейОстатки.АналитикаПланирования КАК АналитикаПланирования,
	|	ПланированиеПотребностейОстатки.КоличествоОстаток КАК Количество,
	|	ПланированиеПотребностейОстатки.СуммаОстаток КАК Сумма,
	|	ПланированиеПотребностейОстатки.АналитикаПланирования.АналитикаНоменклатуры.Номенклатура КАК Номенклатура,
	|	ПланированиеПотребностейОстатки.АналитикаПланирования.АналитикаНоменклатуры.Характеристика КАК Характеристика,
	|	ПланированиеПотребностейОстатки.АналитикаПланирования.АналитикаНоменклатуры.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ПланированиеПотребностейОстатки.АналитикаПланирования.АналитикаНоменклатуры.Коэффициент КАК Коэффициент,
	|	ПланированиеПотребностейОстатки.АналитикаПланирования.ДатаОперации КАК ДатаПоставки,
	|	ВЫБОР
	|		КОГДА ПланированиеПотребностейОстатки.АналитикаПланирования.АналитикаНоменклатуры.Номенклатура ССЫЛКА Справочник.Номенклатура
	|			ТОГДА ПланированиеПотребностейОстатки.АналитикаПланирования.Цена
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Цена,
	|	ПланированиеПотребностейОстатки.АналитикаПланирования.УсловиеОплаты КАК УсловиеОплаты,
	|	ПланированиеПотребностейОстатки.АналитикаПланирования.АналитикаСтруктуры.Организация КАК Организация,
	|	ПланированиеПотребностейОстатки.АналитикаПланирования.АналитикаСтруктуры.ЦФО КАК ЦФО,
	|	ПланированиеПотребностейОстатки.АналитикаПланирования.АналитикаСтруктуры.Проект КАК Проект,
	|	ПланированиеПотребностейОстатки.АналитикаПланирования.АналитикаПотребностей.МестоПоставки КАК МестоПоставки,
	|	ПланированиеПотребностейОстатки.АналитикаПланирования.АналитикаПотребностей.Приоритет КАК Приоритет,
	|	ПланированиеПотребностейОстатки.АналитикаПланирования.АналитикаПотребностей.Менеджер КАК Менеджер,
	|	ПланированиеПотребностейОстатки.АналитикаПланирования.АналитикаПотребностей.Назначение КАК Назначение,
	|	&ОбъектПланирования КАК Лот,
	|	ПланированиеПотребностейОстатки.АналитикаПланирования.АналитикаПоставки.СтавкаНДС КАК СтавкаНДС,
	|	ПланированиеПотребностейОстатки.АналитикаПланирования.АналитикаСтатейБюджетов.СтатьяБюджета КАК СтатьяБюджета,
	|	ПланированиеПотребностейОстатки.АналитикаПланирования.АналитикаСтатейБюджетов.Аналитика1 КАК Аналитика1,
	|	ПланированиеПотребностейОстатки.АналитикаПланирования.АналитикаСтатейБюджетов.Аналитика2 КАК Аналитика2,
	|	ПланированиеПотребностейОстатки.АналитикаПланирования.АналитикаСтатейБюджетов.Аналитика3 КАК Аналитика3,
	|	ПланированиеПотребностейОстатки.АналитикаПланирования.АналитикаСтатейБюджетов.Аналитика4 КАК Аналитика4,
	|	ПланированиеПотребностейОстатки.АналитикаПланирования.АналитикаСтатейБюджетов.Аналитика5 КАК Аналитика5,
	|	ПланированиеПотребностейОстатки.АналитикаПланирования.АналитикаСтатейБюджетов.Аналитика6 КАК Аналитика6
	|ПОМЕСТИТЬ ОстаткиНоменклатуры
	|ИЗ
	|	РегистрНакопления.ПланированиеПотребностей.Остатки(, АналитикаПланирования.Этап = &ЭтапПланирования) КАК ПланированиеПотребностейОстатки
	|ГДЕ
	|	ПланированиеПотребностейОстатки.АналитикаПланирования.ОбъектПланирования = &ОбъектПланирования
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабПериодов.Период КАК Период,
	|	ТабПериодов.Активная КАК Активная,
	|	ТабПериодов.ИмяКолонки КАК ИмяКолонки
	|ПОМЕСТИТЬ ТабПериодов
	|ИЗ
	|	&ТаблицаПериодов КАК ТабПериодов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЧНоменклатура.АналитикаПланирования КАК АналитикаПланирования,
	|	ТЧНоменклатура.АналитикаИсточника КАК АналитикаИсточника,
	|	ТЧНоменклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ТЧНоменклатура.Количество КАК Количество,
	|	ТЧНоменклатура.Коэффициент КАК Коэффициент,
	|	ТЧНоменклатура.Менеджер КАК Менеджер,
	|	ТЧНоменклатура.МестоПоставки КАК МестоПоставки,
	|	ТЧНоменклатура.Номенклатура КАК Номенклатура,
	|	ТЧНоменклатура.Характеристика КАК Характеристика,
	|	ТЧНоменклатура.Организация КАК Организация,
	|	ТЧНоменклатура.ПериодПотребности КАК ПериодПотребности,
	|	ТЧНоменклатура.Приоритет КАК Приоритет,
	|	ТЧНоменклатура.Проект КАК Проект,
	|	ТЧНоменклатура.СтавкаНДС КАК СтавкаНДС,
	|	ТЧНоменклатура.Сумма КАК Сумма,
	|	ТЧНоменклатура.СуммаНДС КАК СуммаНДС,
	|	ТЧНоменклатура.Цена КАК Цена,
	|	ТЧНоменклатура.ДоговорСПокупателем КАК ДоговорСПокупателем
	|ПОМЕСТИТЬ ТЧНоменклатураСАналитиками
	|ИЗ
	|	&ПараметрТЧНоменклатура КАК ТЧНоменклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЧНоменклатура.АналитикаПланирования КАК АналитикаПланирования,
	|	ТЧНоменклатура.АналитикаИсточника КАК АналитикаИсточника,
	|	ТЧНоменклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ISNULL(ОстаткиНоменклатуры.Количество,0) КАК Количество,
	|	ТЧНоменклатура.Коэффициент КАК Коэффициент,
	|	ТЧНоменклатура.Менеджер КАК Менеджер,
	|	ТЧНоменклатура.МестоПоставки КАК МестоПоставки,
	|	ТЧНоменклатура.Номенклатура КАК Номенклатура,
	|	ТЧНоменклатура.Характеристика КАК Характеристика,
	|	ТЧНоменклатура.Организация КАК Организация,
	|	ТЧНоменклатура.ПериодПотребности КАК ПериодПотребности,
	|	ТЧНоменклатура.Приоритет КАК Приоритет,
	|	ТЧНоменклатура.Проект КАК Проект,
	|	ТЧНоменклатура.СтавкаНДС КАК СтавкаНДС,
	|	ISNULL(ОстаткиНоменклатуры.Сумма,0) КАК Сумма,
	|	ТЧНоменклатура.СуммаНДС КАК СуммаНДС,
	|	ТЧНоменклатура.Цена КАК Цена,
	|	ТЧНоменклатура.ДоговорСПокупателем КАК ДоговорСПокупателем
	|ПОМЕСТИТЬ ТЧНоменклатура
	|ИЗ
	|	ТЧНоменклатураСАналитиками КАК ТЧНоменклатура
	|		Внутреннее СОЕДИНЕНИЕ ОстаткиНоменклатуры КАК ОстаткиНоменклатуры
	|		ПО ТЧНоменклатура.АналитикаИсточника = ОстаткиНоменклатуры.АналитикаИсточника
	|	Где ISNULL(ОстаткиНоменклатуры.Сумма,0) > 0 И
	|	ISNULL(ОстаткиНоменклатуры.Количество,0) >= 0	
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЧНоменклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ТЧНоменклатура.Количество КАК Количество,
	|	ТЧНоменклатура.Коэффициент КАК Коэффициент,
	|	ТЧНоменклатура.Менеджер КАК Менеджер,
	|	ТЧНоменклатура.МестоПоставки КАК МестоПоставки,
	|	ТЧНоменклатура.Номенклатура КАК Номенклатура,
	|	ТЧНоменклатура.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ТЧНоменклатура.Номенклатура ССЫЛКА Справочник.Номенклатура
	|			ТОГДА ВЫБОР
	|					КОГДА ВЫРАЗИТЬ(ТЧНоменклатура.Номенклатура КАК Справочник.Номенклатура).ИспользованиеХарактеристик ЕСТЬ NULL
	|						ТОГДА ЛОЖЬ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ВЫРАЗИТЬ(ТЧНоменклатура.Номенклатура КАК Справочник.Номенклатура).ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать)
	|								ТОГДА ЛОЖЬ
	|							ИНАЧЕ ВЫБОР
	|									КОГДА ВЫРАЗИТЬ(ТЧНоменклатура.Номенклатура КАК Справочник.Номенклатура).ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ПустаяСсылка)
	|										ТОГДА ЛОЖЬ
	|									ИНАЧЕ ИСТИНА
	|								КОНЕЦ
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ХарактеристикиИспользуются,
	|	ТЧНоменклатура.Организация КАК Организация,
	|	ТЧНоменклатура.ПериодПотребности КАК ПериодПотребности,
	|	ТЧНоменклатура.Приоритет КАК Приоритет,
	|	ТЧНоменклатура.Проект КАК Проект,
	|	ТЧНоменклатура.ДоговорСПокупателем КАК ДоговорСПокупателем,
	|	ТЧНоменклатура.СтавкаНДС КАК СтавкаНДС,
	|	ТЧНоменклатура.Сумма КАК Сумма,
	|	ТЧНоменклатура.СуммаНДС КАК СуммаНДС,
	|	ТЧНоменклатура.Цена КАК Цена,
	|	ВЫБОР
	|		КОГДА ТЧНоменклатура.Номенклатура ССЫЛКА Справочник.Номенклатура
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЭтоКатегорияНоменклатуры,
	|	ТабПериодов.ИмяКолонки КАК ИмяКолонки,
	|	0 КАК НомерСтроки
	|ИЗ
	|	ТЧНоменклатура КАК ТЧНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТабПериодов КАК ТабПериодов
	|		ПО ТЧНоменклатура.ПериодПотребности = ТабПериодов.Период
	|			И (ТабПериодов.Активная)";
	Запрос.Текст = Запрос.Текст + "УПОРЯДОЧИТЬ ПО "
	+ ИменаКлючевыхПолейКроссТаблицы;
	Запрос.УстановитьПараметр("ТаблицаПериодов",
	ПериодыЗакупок.Выгрузить());
	Запрос.УстановитьПараметр("ПараметрТЧНоменклатура",
	?(Объект.ВидЗакупки <> Перечисления.ВидЛотовойЗакупки.Зонтичная,ТЧНоменклатура.Выгрузить(),
	ТЧНоменклатура.Выгрузить(Новый Структура("МестоПобедителя",МестоПоЗонтичнойЗакупке))));
	Возврат Запрос.Выполнить();
КонецФункции

&НаСервере
Процедура ЗаполнитьОбъектДляКроссТаблицыПотребностей(Контекст, ОбъектДляЗаполнения) Экспорт
	ОбъектДляЗаполнения.Периодичность =	ЦентрализованныеЗакупкиУХ.ПолучитьПериодичностьЗакупок();								
	ЗаполнитьЗначенияСвойств(ОбъектДляЗаполнения, Объект);
	ОбъектДляЗаполнения.ДатаНачала = Объект.ПериодЗакупок.ДатаНачала;
	ОбъектДляЗаполнения.ДатаОкончания = Объект.ПериодЗакупок.ДатаОкончания;
	Если НЕ ЗначениеЗаполнено(ОбъектДляЗаполнения.ДатаКурса) Тогда
		ОбъектДляЗаполнения.ДатаКурса = Объект.ДатаНачалаПериодаПоставки;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ОбъектДляЗаполнения.ДатаКурса) Тогда
		ОбъектДляЗаполнения.ДатаКурса = ТекущаяДатаСеанса();
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура СоздатьДоговорПоПозициямЛота(Команда)
	
	Структура = ЗаполнитьДокументНаСервере();
	Структура.ЗначенияЗаполнения.Вставить("Лот",Объект.Ссылка);
	
	ОткрытьФорму("Справочник.ДоговорыКонтрагентов.ФормаОбъекта", Структура);


КонецПроцедуры

&НаСервере
Функция ПолучитьОстаткиПоНоменклатуре(Объект)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОбъектПланирования",ОбъектыПланирования.ПолучитьОбъектПланирования(Объект.Ссылка));
	Запрос.УстановитьПараметр("ЭтапПланирования",ПредопределенноеЗначение("Перечисление.ЭтапыПланированияПотребностей.ЗакупочныеПроцедуры"));
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПланированиеПотребностейОстатки.АналитикаИсточника КАК АналитикаИсточника,
	               |	ПланированиеПотребностейОстатки.АналитикаПланирования КАК АналитикаПланирования,
	               |	ПланированиеПотребностейОстатки.КоличествоОстаток КАК Количество,
	               |	ПланированиеПотребностейОстатки.СуммаОстаток КАК Сумма,
	               |	ПланированиеПотребностейОстатки.АналитикаПланирования.АналитикаНоменклатуры.Номенклатура КАК Номенклатура,
	               |	ПланированиеПотребностейОстатки.АналитикаПланирования.АналитикаНоменклатуры.Характеристика КАК Характеристика,
	               |	ПланированиеПотребностейОстатки.АналитикаПланирования.АналитикаНоменклатуры.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	ПланированиеПотребностейОстатки.АналитикаПланирования.АналитикаНоменклатуры.Коэффициент КАК Коэффициент,
	               |	ПланированиеПотребностейОстатки.АналитикаПланирования.ДатаОперации КАК ДатаПоставки,
	               |	ВЫБОР
	               |		КОГДА ПланированиеПотребностейОстатки.АналитикаПланирования.АналитикаНоменклатуры.Номенклатура ССЫЛКА Справочник.Номенклатура
	               |			ТОГДА ПланированиеПотребностейОстатки.АналитикаПланирования.Цена
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Цена,
	               |	ПланированиеПотребностейОстатки.АналитикаПланирования.УсловиеОплаты КАК УсловиеОплаты,
	               |	ПланированиеПотребностейОстатки.АналитикаПланирования.АналитикаСтруктуры.ЦФО КАК Организация,
	               |	ПланированиеПотребностейОстатки.АналитикаПланирования.АналитикаСтруктуры.Проект КАК Проект,
	               |	ПланированиеПотребностейОстатки.АналитикаПланирования.АналитикаПотребностей.МестоПоставки КАК МестоПоставки,
	               |	ПланированиеПотребностейОстатки.АналитикаПланирования.АналитикаПотребностей.Приоритет КАК Приоритет,
	               |	ПланированиеПотребностейОстатки.АналитикаПланирования.АналитикаПотребностей.Менеджер КАК Менеджер,
	               |	ПланированиеПотребностейОстатки.АналитикаПланирования.АналитикаПотребностей.Назначение КАК Назначение,
	               |	&ОбъектПланирования КАК Лот,
	               |	ПланированиеПотребностейОстатки.АналитикаПланирования.АналитикаПоставки.СтавкаНДС КАК СтавкаНДС,
	               |	ПланированиеПотребностейОстатки.АналитикаПланирования.АналитикаСтатейБюджетов.СтатьяБюджета КАК СтатьяБюджета,
	               |	ПланированиеПотребностейОстатки.АналитикаПланирования.АналитикаСтатейБюджетов.Аналитика1 КАК Аналитика1,
	               |	ПланированиеПотребностейОстатки.АналитикаПланирования.АналитикаСтатейБюджетов.Аналитика2 КАК Аналитика2,
	               |	ПланированиеПотребностейОстатки.АналитикаПланирования.АналитикаСтатейБюджетов.Аналитика3 КАК Аналитика3,
	               |	ПланированиеПотребностейОстатки.АналитикаПланирования.АналитикаСтатейБюджетов.Аналитика4 КАК Аналитика4,
	               |	ПланированиеПотребностейОстатки.АналитикаПланирования.АналитикаСтатейБюджетов.Аналитика5 КАК Аналитика5,
	               |	ПланированиеПотребностейОстатки.АналитикаПланирования.АналитикаСтатейБюджетов.Аналитика6 КАК Аналитика6
	               |ИЗ
	               |	РегистрНакопления.ПланированиеПотребностей.Остатки(, АналитикаПланирования.Этап = &ЭтапПланирования) КАК ПланированиеПотребностейОстатки
	               |ГДЕ
	               |	ПланированиеПотребностейОстатки.АналитикаПланирования.ОбъектПланирования = &ОбъектПланирования";
	ТаблицаПотребностей = Запрос.Выполнить().Выгрузить();
	ПланированиеПотребностей.ЗаменаСтатейИАналитикПоНастройкамЛимитов(ТекущаяДата(),ТаблицаПотребностей);	
	АдресТЗ = ПоместитьВоВременноеХранилище(ТаблицаПотребностей, УникальныйИдентификатор);	
	Возврат АдресТЗ;
КонецФункции

&НаСервере
Функция ЗаполнитьДокументНаСервере()
	
	
	ЗначенияЗаполнения = Новый Структура();
	ЗначенияЗаполнения.Вставить("ВидДоговораУХ",  Справочники.ВидыДоговоровКонтрагентовУХ.СПоставщиком);
 
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Ключ",                Неопределено);
	СтруктураПараметров.Вставить("ЗначенияЗаполнения",  ЗначенияЗаполнения);
	СтруктураПараметров.Вставить("АдресНоменклатуры",  ПолучитьОстаткиПоНоменклатуре(Объект));
	
	Возврат СтруктураПараметров;
	
КонецФункции	

&НаСервере
Процедура ПерезаполнитьПотребностиПоЗонтичнойЗакупке()
	
	ИменаКлючевыхПолей = ЦентрализованныеЗакупкиКлиентСерверУХ.ИменаКлючевыхПолейКроссТаблицыПотребностей();
	КонтенкстКроссТаблицы = ЦентрализованныеЗакупкиУХ.ПолучитьТиповойКонтекстКроссТаблицыПотребностей(
	"ПериодыЗакупок", "ПотребностиВНоменклатуреПоПериодам",	
	"ПотребностиВНоменклатуреПоПериодам", ИменаКлючевыхПолей);

	ЗонтичнаяНоменклатура = "УсловияРаспределенияЗонтичнойЗакупки";
	ПотребностиВНоменклатуреПоПериодам.Очистить();
	РезультатЗапроса = ПолучитьРезультатЗапросаТЧНоменклатурыПоПериодам(
	Объект[ЗонтичнаяНоменклатура],
	ЭтаФорма[КонтенкстКроссТаблицы.ИмяТаблицыПериодов],
	ИменаКлючевыхПолей);		
	
	ДозаполнитьТаблицуПотребностейИзРезультатаЗапроса(
	РезультатЗапроса); 
	
КонецПроцедуры

&НаКлиенте
Процедура МестоПоЗонтичнойЗакупкеПриИзменении(Элемент)
	ПерезаполнитьПотребностиПоЗонтичнойЗакупке()
КонецПроцедуры
